arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_edma_hal.h
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_MAJORELINK_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Enables/Disables the scatter/gather feature for the TCD.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param enable Enables (true) /Disables (false) scatter/gather feature.
 */
static inline void EDMA_HAL_TCDSetScatterGatherCmd(DMA_Type * base, uint32_t channel, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_ESG_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Disables/Enables the DMA request after the major loop completes for the TCD.
 *
 * If disabled, the eDMA hardware automatically clears the corresponding DMA request when the
 * current major iteration count reaches zero.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param disable Disable (true)/Enable (false) DMA request after TCD complete.
 */
static inline void EDMA_HAL_TCDSetDisableDmaRequestAfterTCDDoneCmd(DMA_Type * base, uint32_t channel, bool disable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_DREQ_SHIFT) = (uint32_t)disable;
}

/*!
 * @brief Enables/Disables the half complete interrupt for the TCD.
 *
 * If set, the channel generates an interrupt request by setting the appropriate bit in the
 * interrupt register when the current major iteration count reaches the halfway point. Specifically,
 * the comparison performed by the eDMA engine is (CITER == (BITER >> 1)). This half-way point
 * interrupt request is provided to support the double-buffered schemes or other types of data movement
 * where the processor needs an early indication of the transfer's process.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param enable Enable (true) /Disable (false) half complete interrupt.
 */
static inline void EDMA_HAL_TCDSetHalfCompleteIntCmd(DMA_Type * base, uint32_t channel, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_INTHALF_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Enables/Disables the interrupt after the major loop completes for the TCD.
 *
 * If enabled, the channel generates an interrupt request by setting the appropriate bit in the
 * interrupt register when the current major iteration count reaches zero.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param enable Enable (true) /Disable (false) interrupt after TCD done.
 */
static inline void EDMA_HAL_TCDSetIntCmd(DMA_Type * base, uint32_t channel, bool enable)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_INTMAJOR_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Triggers the start bits for the TCD.
 *
 * The eDMA hardware automatically clears this flag after the channel begins execution.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 */
static inline void EDMA_HAL_TCDTriggerChannelStart(DMA_Type * base, uint32_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    BITBAND_ACCESS32(&(base->TCD[channel].CSR), DMA_TCD_CSR_START_SHIFT) = (uint32_t)1U;
}

/*!
 * @brief Checks whether the channel is running for the TCD.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return True stands for running. False stands for not.
 */
static inline bool EDMA_HAL_TCDGetChannelActiveStatus(DMA_Type * base, uint32_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    return (bool)((base->TCD[channel].CSR >> DMA_TCD_CSR_ACTIVE_SHIFT) & 1U);
}

/*!
 * @brief Sets the channel minor link for the TCD.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param linkChannel Channel to be linked on minor loop complete.
 * @param enable Enable (true)/Disable (false) channel minor link.
 */
void EDMA_HAL_TCDSetChannelMinorLink(DMA_Type * base, uint32_t channel, uint32_t linkChannel, bool enable);

/*!
 * @brief Sets the major iteration count according to minor loop channel link setting.
 *
 * Note here that user need to first set the minor loop channel link and then call this function.
 * The execute flow inside this function is dependent on the minor loop channel link setting.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @param count major loop count
 */
void EDMA_HAL_TCDSetMajorCount(DMA_Type * base, uint32_t channel, uint32_t count);

/*!
 * @brief Returns the begin major iteration count.
 *
 * Gets the begin major iteration count according to minor loop channel link settings.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return begin iteration count
 */
uint32_t EDMA_HAL_TCDGetBeginMajorCount(DMA_Type * base, uint32_t channel);

/*!
 * @brief Returns the current major iteration count.
 *
 * Gets the current major iteration count according to minor loop channel link settings.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return current iteration count
 */
uint32_t EDMA_HAL_TCDGetCurrentMajorCount(DMA_Type * base, uint32_t channel);

/*!
 * @brief Gets the number of bytes already transferred for the TCD.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return data bytes already transferred
 */
uint32_t EDMA_HAL_TCDGetFinishedBytes(DMA_Type * base, uint32_t channel);

/*!
 * @brief Gets the number of bytes haven't transferred for the TCD.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return data bytes already transferred
 */
uint32_t EDMA_HAL_TCDGetUnfinishedBytes(DMA_Type * base, uint32_t channel);

/*!
 * @brief Gets the channel done status.
 *
 * @param base Register base address for eDMA module.
 * @param channel eDMA channel number.
 * @return If channel done.
 */
static inline bool EDMA_HAL_TCDGetDoneStatusFlag(DMA_Type * base, uint32_t channel)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(channel < FSL_FEATURE_EDMA_MODULE_CHANNEL);
#endif
    return (bool)((base->TCD[channel].CSR >> DMA_TCD_CSR_DONE_SHIFT) & 1U);
}

/*! @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* __EDMA_HAL_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/


